src/cf/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранимыеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВРабочемМестеКассира</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаГруппы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Товары/Forms/ФормаГруппы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.КартинкаГруппы.Получить() <> Неопределено Тогда
		КартинкаФона = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "КартинкаГруппы");   
		Элементы.УдалитьКартинку.Видимость = Истина;
	Иначе
		Элементы.УдалитьКартинку.Видимость = Ложь;
	КонецЕсли;
	
	ЦветФона = Объект.ЦветФона.Получить();
	Элементы.ОтображениеВРабочемМестеКассира.Видимость = Объект.ОтображатьВРабочемМестеКассира;

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьВРабочемМестеКассираПриИзменении(Элемент)

	Элементы.ОтображениеВРабочемМестеКассира.Видимость = Объект.ОтображатьВРабочемМестеКассира;

КонецПроцедуры


&НаКлиенте
Процедура ЦветФонаПриИзменении(Элемент)

	ЦветФонаПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЦветФонаПриИзмененииНаСервере()

	Объект.ЦветФона = Новый ХранилищеЗначения(ЦветФона, Новый СжатиеДанных());
	Модифицированность = Истина;

КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьКартинку(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов; 
	
	Файл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, УникальныйИдентификатор);
	
	Если Файл <> Неопределено Тогда
		КартинкаФона = Файл.Адрес;
		Модифицированность = Истина;  
		КартинкаЗагружена = Истина; 
		КартинкаУдалена = Ложь;    
		Элементы.УдалитьКартинку.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	
	Если КартинкаЗагружена Тогда
		ТекущийОбъект.КартинкаГруппы = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(КартинкаФона));
		УдалитьИзВременногоХранилища(КартинкаФона);
	КонецЕсли;
	
	Если КартинкаУдалена Тогда
		ТекущийОбъект.КартинкаГруппы = Неопределено;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьКартинку(Команда)      

	Модифицированность = Истина;  
	КартинкаФона = "";
	КартинкаУдалена = Истина;      
	КартинкаЗагружена = Ложь;  
	Элементы.УдалитьКартинку.Видимость = Ложь;

КонецПроцедуры
